Repository: dsilakov/rosa-freeze
Catalog: po/*.po
Languages: ru

source: error in config "%(path)s": %(exception)s
ru: ошибка в файле конфигурации "%(path)s": %(exception)s

source: NOTE: '%s' folder is mounted from another partition, it will not be frozen
ru: ВНИМАНИЕ: директория '%s' смонтирована с отдельного раздела, она не будет заморожена

source: ROSA Freeze Configuration Tool
ru: Инструментарий настройки ROSA Freeze

source: Enable Freeze mode
ru: Включить режим заморозки

source: Folders to be skipped, separated by colon, without leading slash (e.g., home:media:mnt)
ru: Директории, которые не надо замораживать, разделенные двоеточием, без слэша в начале (например, home:media:mnt)

source: Device to be used as a temporary storage for filesystem modifications. By default, ROSA Freeze uses tmpfs. With this option you can specify device partinion (e.g., /dev/sda1) to be used for this purposes. Rememeber that the storage device should not contain any valuable data, since all the data on it will be removed!
ru: Устройство для использования в качестве временного хранилища модификаций файловой системы. По умолчанию, ROSA Freeze использует tmpfs. С помощью этой опции, вы можете указать раздел жесткого диска (например, /dev/sda1), который будет использован для этих целей. Все данные на этом разделе будут уничтожены!

source: Folder to be used as a temporary storage for filesystem modifications. By default, ROSA Freeze uses tmpfs. With this option you can specify a folder to be used for this purposes. The folder should be a top-level one (e.g. /rosa-freeze) or be located inside a folder which is not subjected to the freeze.
ru: Директория для использования в качестве временного хранилища модификаций файловой системы. По умолчанию, ROSA Freeze использует tmpfs. С помощью этой опции, вы можете указать директорию, которая будет использована для этих целей. Допускается использование директорий верхнего уровня либо других директорий, находящихся в папках, которые не будут заморожены.

source: Disable Freeze mode
ru: Отключить режим заморозки

source: Get ROSA Freeze status
ru: Узнать текущий статус заморозки

source: Merge current system state into the original one
ru: Сделать текущее состояние системы базовым

source: Create restore point - save original state of the system and then merge the current system into the original one
ru: Создать точку отката - сохранить исходное базовое состояние системы и перенести в него все текущие изменения, предусмотрев возможность отката

source: Get list of restore points which can be used for rollback
ru: Получить список точек, на которые может быть произведен откат

source: Rollback system to a given restore point
ru: Откатить систему на заданную точку

source: restore point (run "rfreeze list-points" to get possible values)
ru: точка отката (запустите "rfreeze list-points" для получения доступных точек отката)

source: Unsupported storage type in config:
ru: Неподдерживаемый вид хранилища в файое конфигурации:

source: Freeze mode has been enabled.
ru: Режим заморозки успешно включен.

source: ROSA Freeze is already enabled.
ru: Режим заморозки уже включен.

source: You didn't reboot computer after ROSA Freeze was disabled. Please reboot the machine first.
ru: Вы не перегружали машину после отключения режима заморозки. Пожалуйста, сначала перегрузите компьютер.

source: Failed to detect UUID for the storage device
ru: Не удалось определить UUID для устройства

source: Storage device is already mounted at
ru: Устройство хранения изменений уже смонтировано на

source: . Please make a backup of all data located on it and umount it.
ru: . Пожалуйста, сделайте резервные копии находящихся на нем данных и отмонтируйте его.

source: Something went wrong when enabling freeze mode, please inform developers...
ru: Что-то пошло не так при включении режима заморозки. Пожалуйста, сообщите об этом разработчикам.

source: Freeze mode has been disabled. Please reboot your system.
ru: Режим заморозки отключен. пожалуйста, перезагрузите систему.

source: You don't have ROSA Freeze enabled.
ru: Режим заморозки отключен.

source: Something went wrong when disabling freeze mode, please inform developers...
ru: Что-то пошло не так при отключении режима заморозки. Пожалуйста, сообщите об этом разработчикам.

source: The current state of the system has been merged to the original one.
ru: Базовое состояние системы успешно синхронизировано с текущим

source: Something went wrong during merge, please inform developers...
ru: Что-то пошло не так при слиянии изменений. Пожалуйста, сообщите об этом разработчикам.

source: The following restore points are available:
ru: Доступны следующие точки отката:

source: No restore points are available
ru: Нет доступных точек отката

source: Freeze mode is enabled
ru: Режим заморозки включен

source: Freeze mode is disabled
ru: Режим заморозки отключен

source: Freeze mode has been disabled, but you need to reboot to work with unfrozen system
ru: Режим заморозки был отключен, но необходимо перезагрузить систему, чтобы начать работать с ОС в штатном режиме

source: INTERNAL ERROR, get_status() returned
ru: ВНУТРЕННЯЯ ОШИБКА, get_status() вернул
